export const descriptionText: { icon: string; paragraph: string[] }[] = [
  {
    icon: "⏰",
    paragraph: [
      "질문당 제한 시간은 60초입니다.",
      "주어진 시간이 모두 경과되면 자동으로 답변 녹화가 종료되고 다음 질문으로 넘어가니 주의해 주세요!",
    ],
  },
  {
    icon: "💻",
    paragraph: [
      "화상 면접을 진행하는 경우 데스크탑, 노트북과 같은 PC 환경 또는 가로 모드의 태블릿 PC를 이용하는 것을 추천합니다.",
      "일부 모바일 환경에서는 카메라 화면과 컨트롤러, 면접 질문 등이 한 번에 보이지 않아 면접을 진행하는 데 불편함이 있을 수 있습니다.",
    ],
  },
  {
    icon: "📸",
    paragraph: [
      "질문에 대한 답변이 시작되면 카메라와 마이크를 이용하여 면접자 녹화/녹음을 진행합니다.",
      "만약 녹화를 원치 않으시면 아래 체크박스에서 음성으로만 면접 진행을 선택하실 수 있습니다.",
      "단, 음성 면접의 경우 표정 등의 비언어적 표현 분석 결과가 온전히 제공될 수 없으므로 가급적 녹화를 포함한 화상 면접으로 진행하는 것을 추천합니다.",
    ],
  },
  {
    icon: "🚨",
    paragraph: [
      "면접이 정상적으로 모두 완료되기 전 면접에서 나가면 질문과 답변을 포함한 모든 기록이 저장되지 않으므로 주의해 주세요.",
      "또한, 면접 중에는 새로고침(F5) 또는 브라우저의 뒤로가기 기능이나 다른 페이지로의 이동이 방지되어 있습니다. 반드시 종료 버튼을 눌러 면접에서 나가주시길 바랍니다.",
    ],
  },
];
