export const introText = {
  subtitle: "IT 취준생을 위한",
  title: "CS 기술 구두 면접 대비 & 학습 플랫폼",
  firstText:
    "잇터뷰는 IT 분야로의 취업을 원하는 모든 이들이 CS 기술 면접을 효율적으로 대비할 수 있도록 만들어진 플랫폼입니다.",
  text: "모의 면접을 원하는 상세 과목만, 원하는 질문 개수만큼 선택하여 구성할 수 있으며 각 질문에 대한 예시 답변과 상세한 첨삭, 표정 및 발화 지연/침묵 시간 등의 비언어적 지표를 포함한 자세한 채점 결과를 제공받을 수 있습니다. 개별 질문을 다양한 필터링 기능과 함께 모아보고 재답변을 진행하며 반복 학습을 통한 성장을 돕습니다.",
  button: ["바로 시작하기", "기능 알아보기"],
};

export const tutorialText = [
  {
    subtitle: "원하는 CS 과목의 질문만을 포함한",
    title: "기술 특화 면접",
    text: "광범위한 컴퓨터 과학(Computer Science) 지식, ‘내가 얼마나 알고 있을까?’ 확실히 알지 못해 기술 면접 준비에 어려움을 겪고 있다면 잇터뷰에서 모의 면접을 진행해 보세요. 운영체제, 컴퓨터구조, 자료구조, 데이터베이스, 네트워크, 소프트웨어공학 총 6가지의 CS 과목 중 원하는 과목의 질문만으로 이루어진 면접을 통해 오늘 당장 공부한 내용을 얼마나 잘 학습했는지 테스트할 수도 있습니다. 질문의 개수를 선택하여 원하는 길이로 면접을 진행할 수 있고, 카메라 녹화를 원하지 않는다면 음성으로만 면접을 진행할 수 있습니다.",
    buttonText: "면접 세팅 바로가기",
    path: "/interview/setup",
  },
  {
    subtitle: "답변 내용 정확도와 비언어적 표현에 대한",
    title: "수치화된 자세한 결과 분석",
    text: "면접 결과를 수치화된 척도로 간결하고 확실하게, 또 질문별 첨삭과 피드백으로 상세하게 제공합니다. 각 질문에 대한 답변 내용의 정확도를 정답 또는 부분정답 또는 오답으로 채점하고 첨삭하며, 면접 중 얼굴 표정과 발화 지연 시간과 침묵 시간의 비율을 분석하여 비언어적 표현에 대한 평가 점수를 계산합니다.",
    buttonText: "면접 기록 리스트 바로가기",
    path: "/interview/list",
  },
  {
    subtitle: "반복 학습으로 메타인지 향상을 위한",
    title: "질문 재답변과 학습 노트",
    text: "면접을 진행한 후 나만의 오답노트를 만들어 복습을 거쳐야 ‘내가 아는 것과 모르는 것'에 대해 확실하게 인지할 수 있습니다. 개별 질문에 대한 즐겨찾기 기능을 제공하며, 이후 학습 노트 페이지에서 재답변을 진행할 수 있습니다. 즐겨찾기한 질문, 재답변한 질문, 부분정답 또는 오답이었던 질문, 특정 CS 과목의 질문 등 다양한 모아보기 필터를 제공합니다. 각 질문 페이지에서 최초 답변 기록과 이후 재답변 기록이 함께 쌓이므로 이전 답변들과 비교 분석하며 학습해 보세요.",
    buttonText: "학습 노트 바로가기",
    path: "/question/list",
  },
];
